// Задание 1

// let numbers = [];
// let NumbersPush = numbers.push(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
// console.log(numbers)
// console.log(NumbersPush)

// Задание 2

// for (let num = 20; num > -1; num--){
//     console.log(num)
// }

// Задание 3
// 3.1

// const color = prompt("Выберите цвет (Красный, Зеленный, Жёлтый), можно и английском языке), маленькими БУКВАМИ!");
// switch (color) {
// 	case "green":
// 		console.log("Горит зеленный свет, можно проходить через дорогу!!!");
// 		break;
// 	case "red":
// 		console.log("Горит крассный свет, идти через дорогу нельзя!!!");
// 		break;
// 	case "yellow":
// 		console.log("Горит желтый свет, приготовься идти через дорогу!!!");
// 		break;
//     case "зеленный":
//         console.log("Горит зеленный свет, можно проходить через дорогу!!!");
//         break;
//     case "красный":
//         console.log("Горит крассный свет, идти через дорогу нельзя!!!");
//         break;
//     case "жёлтый":
//         console.log("Горит желтый свет, приготовься идти через дорогу!!!");
//         break;
// 	default:
// 		console.log("Default");
// }

// 3.2

// const color = prompt("Выберите цвет (Красный, Зеленный, Жёлтый), можно и английском языке), маленькими БУКВАМИ!");
// if(color === "красный"){
//     console.log("Горит крассный свет, идти через дорогу нельзя!!!");
// } else if (color === "зеленный"){
//     console.log("Горит зеленный свет, можно проходить через дорогу!!!");
// } else if (color === "жёлтый"){
//     console.log("Горит желтый свет, приготовься идти через дорогу!!!");
// } else if (color === "green"){
//     console.log("Горит зеленный свет, можно проходить через дорогу!!!");
// } else if (color === "yellow"){
//     console.log("Горит желтый свет, приготовься идти через дорогу!!!");
// } else if (color === "red"){
//     console.log("Горит крассный свет, идти через дорогу нельзя!!!");
// } else {
//     alert("Введите правильный цвет!!!")
// }